risDBquery.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://schemas.cisco.com/ast/soap/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
   <soapenv:Header>
      <AstHeader xsi:type="soap:AstHeader">
         <SessionId xsi:type="xsd:string">1212</SessionId>
      </AstHeader>
   </soapenv:Header>
   <soapenv:Body>
      <soap:SelectCmDevice soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <CmSelectionCriteria xsi:type="soap:CmSelectionCriteria">
            <Status xsi:type="xsd:string">Registered</Status>
            <SelectBy xsi:type="xsd:string">Name</SelectBy>
            <SelectItems xsi:type="soap:SelectItems" soapenc:arrayType="soap:SelectItem[2]">
            	<SelectItem>
            	 <Item xsi:type="xsd:string">SEP9CAFCA84C169</Item>
            	</SelectItem>
            	<SelectItem>
            	 <Item xsi:type="xsd:string">SEP9CAFCA84D025</Item>
            	</SelectItem>
            </SelectItems>
         </CmSelectionCriteria>
      </soap:SelectCmDevice>
   </soapenv:Body>
</soapenv:Envelope>